# StructuralConnectionTypeChangedToGeneric Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralConnectionFailures..::..StructuralConnectionTypeChangedToGeneric Property
BuiltInFailures..::..StructuralConnectionFailures Class See Also
---
Structural Connection had an inappropriate type, which has been changed to 'Generic Connection'.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructuralConnectionTypeChangedToGeneric { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralConnectionTypeChangedToGeneric As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructuralConnectionTypeChangedToGeneric {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace